app/Controllers/Messages.php

SELECT *
FROM `messages`
ORDER BY `id` DESC
---
    public function index()
    {
        $model = new MessageModel();

        // Mengurutkan dari pesan terbaru ke paling lama (opsional tapi disarankan)
        $data = $model->orderBy('id', 'DESC')->findAll();

INSERT INTO `messages` (`name`, `whatsapp`, `message`) VALUES ('amelianeesa', '12345678', 'HAYYYYYY PESANANKU YANG CEPERTTT YAAA')
---
    public function create()
    {
        $rules = [
            'name'     => 'required',
            'whatsapp' => 'required',
            'message'  => 'required'
        ];

        if (!$this->validate($rules)) {
            return $this->failValidationErrors($this->validator->getErrors());
        }

        $model = new MessageModel();
        $data = [
            'name'     => $this->request->getVar('name'),
            'whatsapp' => $this->request->getVar('whatsapp'),
            'message'  => $this->request->getVar('message')
        ];

        if ($model->insert($data)) {