app/Controllers/Orders.php

SELECT *
FROM `orders`
---
    public function index()
    {
        $model = new OrderModel();
        $data = $model->findAll();

SELECT *
FROM `orders`
WHERE `orders`.`id` = '1'
---
    public function show($id = null)
    {
        $model = new OrderModel();
        $data = $model->find($id);

SELECT *
FROM `orders`
WHERE `orders`.`id` = '1'
UPDATE `orders` SET `status` = 'proses', `updated_at` = '2026-06-01 22:27:23'
WHERE `orders`.`id` IN ('1')
---
    public function update($id = null)
    {
        $model = new OrderModel();

        $cekData = $model->find($id);
        if (!$cekData) {
            return $this->failNotFound('Data order tidak ditemukan.');
        }

        $data = $this->request->getRawInput();

        if ($model->update($id, $data)) {

SELECT *
FROM `orders`
WHERE `orders`.`id` = '1'
DELETE FROM `orders`
WHERE `id` IN ('1')
---
    public function delete($id = null)
    {
        $model = new OrderModel();

        $cekData = $model->find($id);
        if (!$cekData) {
            return $this->failNotFound('Data order tidak ditemukan untuk dihapus.');
        }

        if ($model->delete($id)) {