app/Controllers/Settings.php

SELECT *
FROM `settings`
 LIMIT 1
---
    public function index()
    {
        $model = new SettingModel();
        $data = $model->first();

SELECT *
FROM `settings`
WHERE `settings`.`id` = '1'
UPDATE `settings` SET `price_daily` = '10000', `price_express` = '14000', `bank_name` = 'BRI', `bank_number` = '18967345', `whatsapp_admin` = '081326811456'
WHERE `settings`.`id` IN ('1')
---
    public function update($id = null)
    {
        $model = new SettingModel();

        $cekData = $model->find($id);
        if (!$cekData) {
            return $this->failNotFound('Data pengaturan tidak ditemukan.');
        }

        $data = $this->request->getRawInput();

        if ($model->update($id, $data)) {