app/Controllers/Users.php

SELECT `id`, `username`, `fullname`, `role`, `phone`, `address`, `profile_image`, `created_at`
FROM `users`
---
    public function index()
    {
        $model = new UserModel();
        $users = $model->select('id, username, fullname, role, phone, address, profile_image, created_at')
                       ->findAll();

INSERT INTO `users` (`username`, `fullname`, `password`, `role`, `phone`, `address`) VALUES ('amelianeesa1', '123456789', '$2y$10$O5Lgy0BpZ5kidZ5eVooEbe8rRpQx7MmjtO69Q9nq9aE5FixTfhoXS', 'user', NULL, NULL)
---
    public function register()
    {
        $rules = [
            'username' => 'required|is_unique[users.username]',
            'fullname' => 'required',
            'password' => 'required|min_length[6]'
        ];

        if (!$this->validate($rules)) {
            return $this->failValidationErrors($this->validator->getErrors());
        }

        $model = new UserModel();

        $data = [
            'username' => $this->request->getVar('username'),
            'fullname' => $this->request->getVar('fullname'),
            'password' => password_hash($this->request->getVar('password'), PASSWORD_BCRYPT),
            'role'     => 'user',
            'phone'    => $this->request->getVar('phone'),
            'address'  => $this->request->getVar('address')
        ];

        if ($model->insert($data)) {

SELECT *
FROM `users`
WHERE `username` = 'amelianeesa'
 LIMIT 1
---
    public function login()
    {
        $rules = [
            'username' => 'required',
            'password' => 'required'
        ];

        if (!$this->validate($rules)) {
            return $this->failValidationErrors($this->validator->getErrors());
        }

        $model = new UserModel();
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        // 1. Cari user berdasarkan username
        $user = $model->where('username', $username)->first();